Repository: TriJetScud/vyatta-strongswan
Catalog: debian/po/*.po
Languages: fi, gl, sv

source: earliest
fi: mahdollisimman aikaisin
gl: o primeiro
sv: tidigt

source: after NFS
fi: NFS:n jälkeen
gl: despois do NFS
sv: efter NFS

source: after PCMCIA
fi: PCMCIA:n jälkeen
gl: despois do PCMCIA
sv: efter PCMCIA

source: When to start strongSwan:
fi: Koska strongSwan käynnistetään:
gl: Cando iniciar strongSwan:
sv: När strongSwan ska startas om:

source: StrongSwan starts during system startup so that it can protect filesystems that are automatically mounted.
fi: StrongSwan käynnistetään järjestelmän käynnistyessä, jotta se voi suojella automaattisesti liitettäviä levyjärjestelmiä.
gl: StrongSwan iniciase durante o arrinque do sistema de maneira que poda protexer sistemas de ficheiros que se monten automaticamente.
sv: StrongSwan startar under systemuppstart så att det kan skydda filsystem som monteras automatiskt.

source: * earliest: if /usr is not mounted through NFS and you don't use a PCMCIA network card, it is best to start strongSwan as soon as possible, so that NFS mounts can be secured by IPSec; * after NFS: recommended when /usr is mounted through NFS and no PCMCIA network card is used; * after PCMCIA: recommended if the IPSec connection uses a PCMCIA network card or if it needs keys to be fetched from a locally running DNS server with DNSSec support.
fi: * mahdollisimman aikaisin: Jos hakemistoa /usr ei liitetä NFS:n avulla, eikä käytössä ole PCMCIA-verkkokortteja, strongSwan kannattaa käynnistää mahdollisimman aikaisin, jotta liitettävät NFS-järjestelmät voidaan suojata IPSecillä. * NFS:n jälkeen: suositeltava, kun käytössä ei ole PCMCIA-verkkokortteja ja /usr liitetään NFS:n avulla. * PCMCIA:n jälkeen: suositeltava, jos IPSec-yhteys käyttää PCMCIA-verkkokorttia tai hakee avaimia paikalliselta DNS-palvelimelta DNSSec-tuen avulla.
gl: * o primeiro: se /usr non se monta mediante NFS e non se emprega unha tarxeta PCMCIA, é mellor iniciar strongSwan tan axiña como se poda, para que as montaxes NFS podan asegurarse mediante IPSec, * despois do NFS: recoméndase cando /usr se monte mediante NFS e non se empregue ningunha tarxeta PCMCIA, * despois do PCMCIA: recoméndase se a conexión IPSec emprega unha tarxeta de rede PCMCIA ou se fose preciso que as chaves se obteñan desde un servidor DNS a executarse localmente con soporte para DNSSec.
sv: * tidigt: om /usr inte monteras genom NFS och om du inte vill använda ett PCMCIA-nätverkskort, är det bäst att starta strongSwan så snart som möjligt, så att NFS-monteringar kan säkras med IPSec; * efter NFS: rekommenderas när /usr monteras genom NFS och inget PCMCIA-nätvärkskort används; * efter PCMCIA: rekommenderas om IPSec-uppkopplingen använder ett PCMCIA-nätverkskort eller om det behöver hämta nycklar från en DNS-server som kör lokalt med DNSSec-stöd.

source: Restart strongSwan now?
fi: Käynnistetäänkö strongSwan uudelleen nyt?
gl: Desexa reiniciar strongSwan agora?
sv: Starta om strongSwan nu?

source: Restarting strongSwan is recommended, because if there is a security fix, it will not be applied until the daemon restarts. However, this might close existing connections and then bring them back up.
fi: On suositeltavaa käynnistää strongSwan-taustaohjelma uudelleen, koska mahdolliset tietoturvapäivitykset eivät tule käyttöön ennen tätä. Tämä saattaa kuitenkin katkaista olemassa olevat yhteydet ja avata ne sitten uudelleen.
gl: Recoméndase reiniciar strongSwan porque se houbese algunha actualización de seguridade non se aplicará até que se reinicie o daemon. Porén, pode pechar as conexións existentes e logo volver a recuperalas.
sv: Att starta om strongSwan rekommenderas eftersom en eventuell säkerhetsrättning inte kommer användas förrän demonen startats om. Detta kan dock eventuellt stänga existerande anslutningar och sedan ta upp dem igen.

source: If you don't restart strongSwan now, you should do so manually at the first opportunity.
fi: Jos et käynnistä strongSwania nyt uudelleen, tee se käsin mahdollisimman pian.
gl: Se non reinicia agora strongSwan debería facelo manualmente en canto poda.
sv: Om du inte startar om strongSwan nu, ska du göra det manuellt så snart tillfälle ges.

source: Start strongSwan's IKEv1 daemon?
fi: Käynnistetäänkö strongSwanin IKEv1-taustaohjelma?
gl: Desexa iniciar o daemon IKEv1 de strongSwan?
sv: Starta strongSwans IKEv1-demon?

source: The pluto daemon must be running to support version 1 of the Internet Key Exchange protocol.
fi: Internet Key Exchange -protokollan version 1 tuki vaatii, että pluto-taustaohjelma on käynnissä.
gl: O daemon pluto debe estar en execución para soportar a versión 1 do protocolo Internet Key Exchange.
sv: Pluto-demonen måste köras för att stödja version 1 av Internet Key Exchange-protokollet.

source: Start strongSwan's IKEv2 daemon?
fi: Käynnistetäänkö strongSwanin IKEv2-taustaohjelma?
gl: Desexa iniciar o IKEv2 de strongSwan?
sv: Starta strongSwans IKEv2-demon?

source: The charon daemon must be running to support version 2 of the Internet Key Exchange protocol.
fi: Internet Key Exchange -protokollan version 2 tuki vaatii, että charon-taustaohjelma on käynnissä.
gl: O daemon charon debe estar en execución para soportar a versión 2 do protocolo Internet Key Exchange.
sv: Charon-demonen måste köras för att stödja version 2 av Internet Key Exchange-protokollet.

source: Create an RSA public/private keypair for this host?
fi: Luodaanko tälle koneelle julkisesta ja salaisesta avaimesta koostuva RSA-avainpari?
gl: Desexa crear un par de chaves pública/privada RSA para este servidor?
sv: Vill du skapa ett RSA-nyckelpar för denna värdmaskin?

source: StrongSwan can use a Pre-Shared Key (PSK) or an RSA keypair to authenticate IPSec connections to other hosts. RSA authentication is generally considered more secure and is easier to administer. You can use PSK and RSA authentication simultaneously.
fi: StrongSwan voi käyttää ennalta vaihdettua avainta (Pre-Shared Key, PSK) tai RSA-avainparia varmentaessaan IPSec-yhteyksiä toisiin koneisiin. RSA-varmennusta pidetään yleisesti turvallisempana ja helpommin ylläpidettävänä. PSK- ja RSA-varmennuksia voidaan käyttää yhtä aikaa.
gl: StrongSwan pode empregar unha chave precompartida (PSK) ou un par de chaves RSA para autenticar as conexións IPSec con outros servidores. A autenticación RSA xeralmente considérase máis segura e é máis fácil de administrar. Pode empregar as autenticacións PSK e RSA á vez.
sv: StrongSwan kan använda en förutdelad nyckel (Pre-Shared Key, PSK) eller ett RSA-nyckelpar för att autentisera IPSec-uppkopplingar till andra värdmaskiner. RSA-autentisering anses generellt vara mer säkert och är enklare att administrera. Du kan använda PSK- och RSA-autentisering samtidigt.

source: If you do not want to create a new public/private keypair, you can choose to use an existing one in the next step.
fi: Jos et halua luoda uutta avainparia, voi valita olemassa olevan parin seuraavassa vaiheessa.
gl: Se son quer crear un novo par de chaves pública/privada, no seguinte paso pode escoller empregar unha xa existente.
sv: Om du inte vill skapa ett nytt nyckelpar kan du välja att använda ett existerande par i nästa steg.

source: Use an existing X.509 certificate for strongSwan?
fi: Tulisiko strongSwanin käyttää olemassa olevaa X.509-varmennetiedostoa?
gl: Desexa empregar un certificado X.509 xa existente para strongSwan?
sv: Vill du använda ett existerande X.509-certifikat för strongSwan?

source: The required information can automatically be extracted from an existing X.509 certificate with a matching RSA private key. Both parts can be in one file, if it is in PEM format. You should choose this option if you have such an existing certificate and key file and want to use it for authenticating IPSec connections.
fi: Vaadittavat tiedot voidaan automaattisesti erottaa olemassa olevasta X.509-varmennetiedostosta täsmäävällä salaisella RSA-avaimella. Avaimen molemmat osat voivat olla samassa tiedostossa, jos se on PEM-muodossa. Valitse tämä vaihtoehto, jos tällaiset varmenne- ja avaintiedostot ovat olemassa ja haluat käyttää niitä IPSec-yhteyksien varmentamiseen.
gl: A información requirida pode extraerse automaticamente a partir dun certificado X.509 xa existente coa chave privada RSA que corresponda. Ambas as partes poden estar nun ficheiro se este está no formato PEM. Debe escoller esta opción se ten tal certificado e chave e quere empregalo para autenticar conexións IPSec.
sv: Den information som behövs kan plockas ut automatiskt från ett existerande X.509-certifikat med en matchande privat RSA-nyckel. Båda delarna kan vara i en fil om den är i PEM-format. Välj detta alternativ om du har ett sådant certifikat och nyckelfil och vill använda det för att autentisera IPSec-anslutningar.

source: File name of your X.509 certificate in PEM format:
fi: PEM-muodossa olevan X.509-varmennetiedoston nimi:
gl: Nome do ficheiro do certificado X.509 en formato PEM:
sv: Namn på filen med ditt X.509-certifikat i PEM-format:

source: Please enter the full location of the file containing your X.509 certificate in PEM format.
fi: Anna PEM-muodossa olevan, X.509-varmenteen sisältävän tiedoston täydellinen polku.
gl: Indique a rota completa ao ficheiro que contén o certificado X.509 en formato PEM.
sv: Ange platsen för den fil som innehåller ditt X.509-certifikat i PEM-format.

source: File name of your existing X.509 private key in PEM format:
fi: PEM-muotoisen, olemassa olevan, salaisen X.509-avaimen tiedostonimi:
gl: Nome do ficheiro coa chave privada X.509 en formato PEM:
sv: Namn på filen med din privata X.509-nyckel i PEM-format:

source: Please enter the full location of the file containing the private RSA key matching your X.509 certificate in PEM format. This can be the same file as the X.509 certificate.
fi: Anna PEM-muodossa olevaan X.509-varmenteeseen täsmäävän salaisen RSA-avaimen täydellinen polku. Tämä voi olla sama tiedosto kuin X.509-varmenteen sisältävä.
gl: Indique a rota completa ao ficheiro que contén a chave privada RSA que se corresponde do certificado X.509 en formato PEM. Este pode ser o mesmo ficheiro que o do certificado X.509.
sv: Ange platsen för den fil som innehåller den privata RSA-nyckel som matchar ditt X.509-certifikat i PEM-format. Detta kan vara samma fil som innehåller X.509-certifikatet.

source: RSA key length:
fi: RSA-avaimen pituus:
gl: Lonxitude da chave RSA:
sv: RSA-nyckellängd:

source: Please enter the length of RSA key you wish to generate. A value of less than 1024 bits is not considered secure. A value of more than 2048 bits will probably affect performance.
fi: Anna luotavan RSA-avaimen pituus. 1024 bittiä lyhyempiä avaimia ei pidetä turvallisina. 2048 bittiä pidemmät avaimet luultavasti heikentävät suorituskykyä.
gl: Indique a lonxitude da chave RSA que desexe xerar. Os valores menores de 1024 bits non se consideran seguros, mentres que os maiores de 2048 bits posibelmente afecten ao rendemento.
sv: Ange längden på nyckeln du vill generera. Ett värde mindre än 1024 bitar anses inte säkert. Ett värde på mer än 2048 bitar kommer antagligen påverka prestanda.

source: Create a self-signed X.509 certificate?
fi: Luodaanko itseallekirjoitettu X.509-varmenne?
gl: Desexa crear un certificado X.509 autoasinado?
sv: Vill du skapa ett självsignerat X.509-certifikat?

source: Only self-signed X.509 certificates can be created automatically, because otherwise a certificate authority is needed to sign the certificate request.
fi: Vain itseallekirjoitettu X.509-varmenne voidaan luoda automaattisesti, koska muussa tapauksessa tarvitaan ulkoinen varmentaja allekirjoittamaan varmennepyyntö.
gl: Só se poden crear automaticamente certificados X.509 autoasinados, porque noutro caso é precisa unha autoridade de certificación para asinar o pedido de certificado.
sv: Endast självsignerade X.509-certifikat kan skapas automatiskt, eftersom det annars behövs en certifikatsutställare som signerar certifikatsförfrågan.

source: If you accept this option, the certificate created can be used immediately to connect to other IPSec hosts that support authentication via an X.509 certificate. However, using strongSwan's PKI features requires a trust path to be created by having all X.509 certificates signed by a single authority.
fi: Jos valitset tämän vaihtoehdon, luotua varmennetta voidaan heti käyttää yhteyksien ottamiseen toisiin IPSEc-koneisiin, jotka tukevat varmentamista X.509-varmenteilla. StrongSwanin PKI-ominaisuuksien käyttö kuitenkin vaatii varmennuspolun, jossa sama varmentaja on allekirjoittanut kaikki X.509-varmenteet.
gl: Se acepta esta opción o certificado que se cree pode empregarse inmediatamente para conectarse con outros servidores IPSec que soporten a autenticación mediante un certificado X.509. Porén, par empregar as funcionalidades PKI de strongSwan requírese que se cree unha rota de confianza asinando todos os certificados X.509 por unha única autoridade.
sv: Om du väljer detta alternativ, kan certifikatet omedelbart användas för att ansluta över IPSec-värdmaskiner som stödjer autentisering via ett X.509-certifikat. Används strongSwans PKI-funktioner krävs däremot att en tillitsväg (eng. trust path) skapas genom att alla X.509-certifikat signeras av en särskild certifikatsutställare.

source: If you do not accept this option, only the RSA private key will be created, along with a certificate request which you will need to have signed by a certificate authority.
fi: Jos et valitse tätä vaihtoehtoa, luodaan vain salainen RSA-avain ja varmennepyyntö, joka pitää lähettää ulkoisen varmentajan allekirjoitettavaksi.
gl: Se non acepta esta opción só se creará a chave privada RSA, xunto cun pedido de certificado que precisará que lle asine unha autoridade de certificación.
sv: Om du inte väljer detta alternativ, kommer endast den privata RSA-nyckeln skapas tillsammans med den certifikatsförfrågan som du behöver få signerad av din certifikatsutställare.

source: Country code for the X.509 certificate request:
fi: X.509-varmennepyynnön maakoodi:
gl: Código de país para o pedido do certificado X.509:
sv: Landskod för X.509-certifikatsförfrågan:

source: Please enter the two-letter ISO3166 country code that should be used in the certificate request.
fi: Anna varmennepyynnössä käytettävä kaksikirjaiminen ISO-3166-maakoodi.
gl: Indique o código de país ISO3166 de dúas letras que se debe empregar no pedido de certificado.
sv: Ange den ISO3166-landskod med 2 bokstäver som ska användas i certifikatsförfrågan. (Sverige har landskod SE.)

source: This field is mandatory; otherwise a certificate cannot be generated.
fi: Tämä kenttä on pakollinen. Ilman sitä varmennetta ei voida luoda.
gl: Este campo é obrigatorio, caso contrario non se poderá xerar un certificado.
sv: Detta är fält är obligatoriskt; annars kan inget certifikat skapas.

source: State or province name for the X.509 certificate request:
fi: X.509-varmennepyynnön osavaltio, lääni tai maakunta:
gl: Nome do estado ou provincia para o pedido de certificado X.509:
sv: Region eller län för X.509-certifikatsförfrågan:

source: Please enter the full name of the state or province to include in the certificate request.
fi: Anna varmennepyyntöön sisällytettävä osavaltion, läänin tai maakunnan koko nimi.
gl: Indique o nome completo do estado ou provincia a incluír no pedido de certificado.
sv: Ange namnet på regionen eller landet som ska användas i certifikatsförfrågan.

source: Locality name for the X.509 certificate request:
fi: X.509-varmennepyynnön paikkakunta:
gl: Nome de localidade para o pedido de certificado X.509:
sv: Lokaliteten för X.509-certifikatsförfrågan:

source: Please enter the locality name (often a city) that should be used in the certificate request.
fi: Anna varmennepyynnössä käytettävä paikkakunnan nimi (usein kaupunki).
gl: Indique o nome da localidade (xeralmente unha cidade) que se debe empregar no pedido de certificado.
sv: Ange lokaliteten (ofta en stad) som ska användas i certifikatsförfrågan.

source: Organization name for the X.509 certificate request:
fi: X.509-varmennepyynnön järjestön nimi:
gl: Nome da organización para o pedido de certificado X.509:
sv: Organisationsnamnet för X.509-certifikatsförfrågan:

source: Please enter the organization name (often a company) that should be used in the certificate request.
fi: Anna varmennepyynnössä käytettävä järjestön nimi (usein yritys).
gl: Indique o nome da organización (xeralmente unha empresa) que se debe empregar no pedido de certificado.
sv: Ange organisationsnamnet (ofta ett företag) som ska användas i certifikatsförfrågan.

source: Organizational unit for the X.509 certificate request:
fi: X.509-varmennepyynnön järjestön yksikkö:
gl: Unidade organizacional para o pedido de certificado X.509:
sv: Organisationsenheten för X.509-certifikatsförfrågan:

source: Please enter the organizational unit name (often a department) that should be used in the certificate request.
fi: Valitse varmennepyynnössä käytettävä järjestön yksikkö (usein osasto).
gl: Indique o nome da unidade organizacional (xeralmente un departamento) que debe empregarse no pedido de certificado.
sv: Ange organisationsenheten (ofta en avdelning) som ska användas i certifikatsförfrågan.

source: Common name for the X.509 certificate request:
fi: X.509-varmennepyynnön yleinen nimi:
gl: Nome común para o pedido de certificado X.509:
sv: Namnet på X.509-certifikatsförfrågan:

source: Please enter the common name (such as the host name of this machine) that should be used in the certificate request.
fi: Anna varmennepyynnössä käytettävä yleinen nimi (kuten tämän koneen verkkonimi).
gl: Indique o nome común (como o nome desta máquina) que se debe empregar no pedido de certificado.
sv: Ange namnet (exempelvis värdnamnet för denna maskin) som ska användas i certifikatsförfrågan.

source: Email address for the X.509 certificate request:
fi: X.509-varmennepyynnön sähköpostiosoite:
gl: Enderezo de correo electrónico para o pedido de certificado X.509:
sv: E-postadressen för X.509-certifikatsförfrågan:

source: Please enter the email address (for the individual or organization responsible) that should be used in the certificate request.
fi: Anna varmennepyynnössä käytettävä sähköpostiosoite (yksityinen ja järjestön).
gl: Indique o enderezo de correo electrónico (do individuo ou do responsábel da organización) que se debe empregar no pedido de certificado.
sv: Ange den e-postadress (till den ansvariga personen eller organisationen) som ska användas i certifikatsförfrågan.

source: Enable opportunistic encryption?
fi: Käytetäänkö opportunistista salausta?
gl: Desexa activar a cifraxe oportunista?
sv: Vill du aktivera opportunistisk kryptering?

source: This version of strongSwan supports opportunistic encryption (OE), which stores IPSec authentication information in DNS records. Until this is widely deployed, activating it will cause a significant delay for every new outgoing connection.
fi: StrongSwanin tämä versio tukee opportunistista salausta (opportunistic encryption, OE), joka tallentaa IPSec-varmennustietoja DNS-tietueisiin. Ennen kuin tämä käytäntö yleistyy laajalti, sen käyttö aiheuttaa merkittävän viiveen jokaiseen uuteen ulospäin otettavaan yhteyteen.
gl: Esta versión de strongSwan soporta a cifraxe oportunista (OE) que garda a información de autenticación de IPSec en rexistros de DNS. Até que estea amplamente utilizado activalo provocará un retardo significativo en cada nova conexión saínte.
sv: Denna version av strongSwan stödjer opportunistisk kryptering (OE), som lagrar IPSec-autentiseringsinformation i DNS-registret. Till dess detta används i stor utsträckning, kommer aktivering av det att orsaka betydande fördröjningar för varje ny utgående anslutning.

source: You should only enable opportunistic encryption if you are sure you want it. It may break the Internet connection (default route) as the pluto daemon starts.
fi: Valitse opportunistinen salaus vain, jos olet varma, että haluat sen käyttöön. Se saattaa rikkoa Internet-yhteyden (oletusreitityksen), kun pluto-taustaohjelma käynnistyy.
gl: Só debería activar a cifraxe oportunista se está certo de que a desexa. Pode estragar a conexión a Internet (a rota por omisión) segundo se inicie o daemon pluto.
sv: Du ska bara aktivera opportunistisk kryptering om du är säker på att du vill ha det. Det kan bryta internetanslutningen (standardvägen) när pluto-demonen startas.
